"""
Модуль с сообщениями для оформления заказов.
"""

send_photo_please = """
📸 <b>Отправьте фото</b>
Пришлите мне фото вашего ключа, брелка или другого предмета, если оно имеется.
"""

get_info_about_order = """
ℹ️ <b>Введите информацию о заказе</b>
Опишите ваш заказ как можно подробнее. Чем больше информации, тем быстрее мы сможем вам помочь!
"""

successful_order = """
✅ <b>Заказ оформлен!</b>
Ваш заказ успешно создан и отправлен на обработку. Ожидайте подтверждения!
"""

text_get_info_about_car = """
🚗 <b>Введите данные об автомобиле</b>
Укажите марку, модель и год выпуска вашего автомобиля.
"""

choice_your_car_or_add_new = """
🚘 <b>Выберите авто или добавьте новое</b>
В системе уже сохранены данные о вашем авто.  
➖ Нажмите на кнопку с ним, если хотите использовать его.  
Или введите информацию о новом авто, чтобы его добавить: Марку, модель, год выпуска.
"""

accepted_information_about_car_go_to_order = """
✅ <b>Информация о вашем авто принята!</b>  
Теперь введите информацию о заказе более подробно! 📋
"""
