"""
Модуль с сообщениями для оформления заказов.
"""

send_photo_please = """
📸 <b>Отправьте фото</b>
Пришлите мне фото вашего ключа, брелка или другого предмета, если оно имеется.
"""

get_info_about_order = """
ℹ️ <b>Введите информацию о заказе</b>
Опишите ваш заказ как можно подробнее. Чем больше информации, тем быстрее мы сможем вам помочь!
"""

successful_order = """
✅ <b>Заказ оформлен!</b>
Ваш заказ успешно создан и отправлен на обработку. Ожидайте подтверждения!
"""

text_get_info_about_car = """
🚗 <b>Введите данные об автомобиле</b>
Укажите марку, модель и год выпуска вашего автомобиля.
"""

choice_your_car_or_add_new = """
🚘 <b>Выберите авто или добавьте новое</b>
В системе уже сохранены данные о вашем авто.  
➖ Нажмите на кнопку с ним, если хотите использовать его.
Или нажмите кнопку "Добавить новое авто".
"""

accepted_information_about_car_go_to_order = """
✅ <b>Информация о вашем авто принята!</b>  
Теперь введите информацию о заказе более подробно! 📋
"""

get_text_about_brand_car = """
😊 Выберите вашу марку авто из списка ниже. Если вы не нашли свою марку, не стесняйтесь ввести ее название вручную! 
"""

get_text_about_model_car = """
🛠 Пожалуйста, выберите вашу модель авто среди предложенных вариантов. Если нужной модели нет в списке, просто введите ее название! ️
"""

get_text_about_year_car = """
🚘 Введите год выпуска вашего авто (например: 2020): 
"""
