"""
Модуль текстов сообщений для регистрации.
"""

welcome_message = """
Первое сообщение которое встречает пользователя в этом боте.

Согласны ли вы на обработку ваших персональных данных?
"""

take_phone = """
Нажмите на кнопку, чтобы поделится своим номером.
"""

number_incorrect = """
Вы ввели неверный номер телефона:
"""

personal_data_agreement = """
СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ

Настоящим я, пользователь Telegram-бота [Название бота], действуя свободно, своей волей и в своем интересе, даю свое согласие индивидуальному предпринимателю [ИП АНОХИН АЛЕКСАНДР ВАЛЕРЬЕВИЧ ИНН 110307242880], зарегистрированному в соответствии с законодательством РФ, на обработку моих персональных данных в соответствии с Федеральным законом от 27.07.2006 №152-ФЗ «О персональных данных».

1. Персональные данные, подлежащие обработке:
 • Имя (указанное в Telegram)
 • Telegram ID
 • Номер телефона (если передан пользователем)
 • Фото (в случае отправки пользователем)

2. Цель обработки персональных данных:
 • Идентификация пользователя в рамках предоставления услуг
 • Оформление заявок и обработка заказов
 • Связь с пользователем для уточнения информации по заказам
 • Улучшение качества обслуживания и доработка сервиса на основе предпочтений клиентов
 • Направление уведомлений и сообщений, связанных с заказами и услугами
 • Информирование о специальных предложениях и акциях (включая рекламные предложения, бонусные программы и скидки)
 • Участие в системе бонусов: начисление, накопление и использование бонусов для скидок на услуги

3. Способы обработки данных:
Обработка данных включает в себя сбор, хранение, использование, удаление. Обработка данных осуществляется с применением автоматизированных систем.

4. Передача данных третьим лицам:
Передача персональных данных третьим лицам не осуществляется, за исключением случаев, предусмотренных законодательством РФ.

5. Срок хранения данных:
Персональные данные хранятся до момента отзыва согласия пользователем либо в течение срока, необходимого для исполнения обязательств по предоставлению услуг.

6. Отзыв согласия:
Пользователь имеет право в любой момент отозвать согласие путем отправки команды /delete_my_data или обращения к администратору. В этом случае все персональные данные пользователя будут удалены в течение 24 часов.

7. Контактная информация:
По вопросам, связанным с обработкой персональных данных, вы можете обратиться к администратору бота:

📧 Email: anokhin.workspace@gmail.com

Нажимая кнопку «Согласен», я подтверждаю, что ознакомлен с условиями обработки моих персональных данных и даю своё согласие на их обработку.
Нажимая кнопку «Отмена», я отказываюсь от использования бота, и взаимодействие прекращается.
"""

error_phone = """
Нажми на кнопку «Поделится контактом», она может быть спрятана тут ⬇️ (знак 🎛)
"""

text_for_successful_registration = """
Вы успешно зарегистрировались!
"""
